garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1764.PIC
        <edc:SFRDef edc:access="---nnnnn" edc:cname="MD1SRC" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="MD1SRC" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-02566_txm_mod_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0x39D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MS" edc:desc="" edc:mask="0x1f" edc:name="MS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="MS0" edc:desc="" edc:mask="0x1" edc:name="MS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MS1" edc:desc="" edc:mask="0x1" edc:name="MS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MS2" edc:desc="" edc:mask="0x1" edc:name="MS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MS3" edc:desc="" edc:mask="0x1" edc:name="MS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MS4" edc:desc="" edc:mask="0x1" edc:name="MS4" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MD1MS" edc:desc="" edc:mask="0x1f" edc:name="MD1MS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="MD1MS0" edc:desc="" edc:mask="0x1" edc:name="MD1MS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD1MS1" edc:desc="" edc:mask="0x1" edc:name="MD1MS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD1MS2" edc:desc="" edc:mask="0x1" edc:name="MD1MS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD1MS3" edc:desc="" edc:mask="0x1" edc:name="MD1MS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD1MS4" edc:desc="" edc:mask="0x1" edc:name="MD1MS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="MD1CARL" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="MD1CARL" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02566_txm_mod_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0x39E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CL" edc:desc="" edc:mask="0xf" edc:name="CL" edc:nzwidth="4"/>
              <edc:AdjustPoint edc:offset="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="CL0" edc:desc="" edc:mask="0x1" edc:name="CL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CL1" edc:desc="" edc:mask="0x1" edc:name="CL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CL2" edc:desc="" edc:mask="0x1" edc:name="CL2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CL3" edc:desc="" edc:mask="0x1" edc:name="CL3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MD1CL" edc:desc="" edc:mask="0xf" edc:name="MD1CL" edc:nzwidth="4"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="MD1CL0" edc:desc="" edc:mask="0x1" edc:name="MD1CL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD1CL1" edc:desc="" edc:mask="0x1" edc:name="MD1CL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD1CL2" edc:desc="" edc:mask="0x1" edc:name="MD1CL2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD1CL3" edc:desc="" edc:mask="0x1" edc:name="MD1CL3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="MD1CARH" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="MD1CARH" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02566_txm_mod_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0x39F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CH" edc:desc="" edc:mask="0xf" edc:name="CH" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="CH0" edc:desc="" edc:mask="0x1" edc:name="CH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CH1" edc:desc="" edc:mask="0x1" edc:name="CH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CH2" edc:desc="" edc:mask="0x1" edc:name="CH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CH3" edc:desc="" edc:mask="0x1" edc:name="CH3" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MD1CH" edc:desc="" edc:mask="0xf" edc:name="MD1CH" edc:nzwidth="4"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="MD1CH0" edc:desc="" edc:mask="0x1" edc:name="MD1CH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD1CH1" edc:desc="" edc:mask="0x1" edc:name="MD1CH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD1CH2" edc:desc="" edc:mask="0x1" edc:name="MD1CH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD1CH3" edc:desc="" edc:mask="0x1" edc:name="MD1CH3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="8" edc:beginaddr="0x400" edc:endaddr="0x420" edc:regionid="sfr8">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x400"/>
        <edc:AdjustPoint edc:offset="2" edc:_addr="0x40C"/>
        <edc:SFRDef edc:access="--nn----" edc:cname="HIDRVC" edc:desc="" edc:impl="0x30" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--00----" edc:name="HIDRVC" edc:nzwidth="8" edc:por="--00----" edc:_addr="0x40E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="HIDC4" edc:desc="" edc:mask="0x1" edc:name="HIDC4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HIDC5" edc:desc="" edc:mask="0x1" edc:name="HIDC5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
